# Создать множество произвольного содержания. После каждой операции выводить множество на экран
# Добавить 34 во множество.
# Удалить 34 из множества

my_set = {1, 99, 'evgenyBaShUrA', 'Minsk', 333}
my_set.add(34)
print(my_set)

my_set.remove(34)
print(my_set)
