# Дана длина ребра куба. Найти объем куба и площадь всей его поверхности.
a = 10
v_kuba = a ** 3
print(f'Объем куба равен {v_kuba}')
s_kuba = a ** 2 * 6
print(f'Площадь поверхности куба равна {s_kuba}')
