# Дана длина ребра куба. Найти объем куба и площадь всей его поверхности.
a = 10
V_kuba = a ** 3
print(f'Объем куба равен {V_kuba}')
S_kuba = a ** 2 * 6
print(f'Площадь поверхности куба равна {S_kuba}')
