# Ввести с клавиатуры имя пользователя.
# Вывести на экран “Hello, [name]!”

user_name = input('What is your name? ')
print(f'Hello, {user_name}!')
