# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.
a = 99
b = -55.6
print(f'Сумма a и b равна {a + b}')
print(f'Разность a и b равна {a - b}')
print(f'Произведение a и b равно {a * b}')
