# Пользователь вводит три числа. Увеличьте первое число в два раза, второе числа уменьшите на 3,
# третье число возведите в квадрат и затем найдите сумму новых трех чисел.

a1 = input('Введите число №1: ')
a1 = int(a1)
a2 = input('Введите число №2: ')
a2 = int(a2)
a3 = input('Введите число №3: ')
a3 = int(a3)
A1 = a1*2
print(A1)
A2 = a2-3
print(A2)
A3 = a3**2
print(A3)
print(f'Сумма числе равна {A1+A2+A3}')

# a1 = input('Введите число №1: ')        <---- этот вариант чуть пострашнее, чем выше, но тоже работает
# a1 = int(a1)
# A1 = a1*2
# print(A1)
# a2 = input('Введите число №2: ')
# a2 = int(a2)
# A2 = a2-3
# print(A2)
# a3 = input('Введите число №3: ')
# a3 = int(a3)
# A3 = a3**2
# print(A3)
#
# print(A1+A2+A3)



