# Даны действительные числа x и y. Получить формулу
# Для нахождения модуля использовать функцию abs(..)
x = -25
y = -15
absolute_x = abs(x)
absolute_y = abs(y)
print((absolute_x - absolute_y) / (1 + (absolute_x * absolute_y)))
