# Создать три переменные, содержащие возраст трех человек, найти сумму и вывести ее на экран.
# Создать еще одну переменную равную среднему арифметическому возрасту, и вывести это значение на экран
my_age = 21
her_age = 44
his_age = 66
x = my_age + her_age + his_age
print(x)

our_mid_age = x / 3
print(our_mid_age)
