# Создать список с фамилиями. Вывести все фамилии, которые начинаются на П и заканчиваются на а

surname_list = ['Петрова', 'Башура', 'Пушкина', 'Семенова', 'Плеханова']
for i, j in enumerate(surname_list):
    print(i, j)

# фамилии вывел, но как вывести нужные, не знаю