# Выведите на экран n раз фразу "I am a programmer". Число n вводит пользователь.

my_quant = int(input())
my_count = 'I am a programmer'
while my_quant(my_count) < my_quant:
    print(my_count)
    my_count = my_count + my_quant
print('the end')

# логика
# сначала вписывается кол-во раз -> после указывается то, что будет повторяться -> затем пока кол-во повторений фразы меньше
# кол-ва повторений, ее прописываем
