# Выведите на экран n раз фразу "I am a programmer". Число n вводит пользователь.

my_quant = int(input())
my_count = 0
while my_count < my_quant:
    print('I am a programmer')
    my_count += 1  # шаг


# логика
# сначала вписывается кол-во раз -> затем наш счетчик на 0 -> затем пока кол-во повторений фразы меньше
# кол-ва повторений, ее прописываем
