# Создать переменные firstname, lastname, age с соответствующими значениями
# Путем сложения получить строку вида:
# Привет, меня зовут Иван Иванович, мне 35 лет
# Вывести на экран саму строку и длину строки
# Примечание: переменную age задавать как строку ‘35’

firstname = 'Иван'
lastname = 'Иванович'
age = '35'
print('Привет, меня зовут ' + firstname + ' ' + lastname + ', мне ' + age + ' лет')
print(len('Привет, меня зовут ' + firstname + ' ' + lastname + ', мне ' + age + ' лет'))

#с помощью фигурных скобок {} можно не расставлять дополнительно знаки вокруг lastname, firstname, age
