# Создать произвольную строку. Получить подстроку с третьего элемента и до конца. Написать два решения с использованием
# полной и сокращенной записи.
a = '0123456789'
print(a[2:len(a):1])
print(a[2:])
