# Создать произвольную строку. Получить подстроку с начала и до седьмого элемента. Написать два решения с использованием
# полной и сокращенной записи.
a = '0123456789'
print(a[0:8:1])
print(a[:8])



