# Создать произвольную строку. Получить подстроку с нечетными элементами.  Написать два решения с использованием
# полной и сокращенной записи.
a = '0123456789'
print(a[0:len(a):2])
print(a[::2])




