# Написать произвольную строку. Получить подстроку, которая начинается с пятого символа, заканчивается
# предпредпоследним символом с шагом три.
a = '0123456789'
print(a[4:len(a) - 2:3])
