# Дан список строк. Отформатировать все строки в формате ‘{i} - {string}’,
# где i это порядковый номер строки в списке. Использовать генератор списков.

my_list_of_str = ['kafnakfnafk', 'faajfajgba', 'ajbgjabgajg', 'agnajgnag', 'jagjangja']
a = [my_list_of_str.index(i) for i in my_list_of_str]
print(a)

#нинаю как делать

